#Использовать asserts
#Использовать ".."

#Область Тесты

&Тест
Процедура ВСекунды_Одна_БезМножественногоОкончания() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВСекунды(1)).Равно("1 second");

КонецПроцедуры

&Тест
Процедура ВСекунды_Несколько_СМножественнымОкончанием() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВСекунды(2)).Равно("2 seconds");

КонецПроцедуры

&Тест
Процедура ВМинуты_Одна_БезМножественногоОкончания() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВМинуты(1)).Равно("1 minute");

КонецПроцедуры

&Тест
Процедура ВМинуты_Несколько_СМножественнымОкончанием() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВМинуты(2)).Равно("2 minutes");

КонецПроцедуры

&Тест
Процедура ВЧасы_Одна_БезМножественногоОкончания() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВЧасы(1)).Равно("1 hour");

КонецПроцедуры

&Тест
Процедура ВЧасы_Несколько_СМножественнымОкончанием() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВЧасы(2)).Равно("2 hours");

КонецПроцедуры

&Тест
Процедура ВДни_Одна_БезМножественногоОкончания() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВДни(1)).Равно("1 day");

КонецПроцедуры

&Тест
Процедура ВДни_Несколько_СМножественнымОкончанием() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВДни(2)).Равно("2 days");

КонецПроцедуры

&Тест
Процедура ВНедели_Одна_БезМножественногоОкончания() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВНедели(1)).Равно("1 week");

КонецПроцедуры

&Тест
Процедура ВНедели_Несколько_СМножественнымОкончанием() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВНедели(2)).Равно("2 weeks");

КонецПроцедуры

&Тест
Процедура ВМесяцы_Одна_БезМножественногоОкончания() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВМесяцы(1)).Равно("1 month");

КонецПроцедуры

&Тест
Процедура ВМесяцы_Несколько_СМножественнымОкончанием() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВМесяцы(2)).Равно("2 months");

КонецПроцедуры

&Тест
Процедура ВГоды_Одна_БезМножественногоОкончания() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВГоды(1)).Равно("1 year");

КонецПроцедуры

&Тест
Процедура ВГоды_Несколько_СМножественнымОкончанием() Экспорт

	Ожидаем.Что(ВремяГитЛаб.ВГоды(2)).Равно("2 years");

КонецПроцедуры

#КонецОбласти
