#Использовать autumn
#Использовать asserts
#Использовать fs
#Использовать oscript-yaml
#Использовать ".."

#Область ВспомогательныеПроцедурыИФункции

// <Описание функции>
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ИмяВыходногоФайла()
	Возврат "tests/output/pipeline.yml";
КонецФункции

Функция ПайплайнРезультат()
	Возврат ЯмлФайлВОбъект(ИмяВыходногоФайла());
КонецФункции

Функция ЯмлФайлВОбъект(ПутьКФайлу)

	Файл = Новый ЧтениеТекста(ПутьКФайлу);
	Текст = Файл.Прочитать();
	Файл.Закрыть();

	Парсер = Новый ПарсерYaml();
	Результат = Парсер.ПрочитатьYaml(Текст);
	Возврат Результат;

КонецФункции

Процедура ПодготовитьКаталогТестирования()
	ФС.ОбеспечитьПустойКаталог("tests/output");
КонецПроцедуры

Функция ФабрикаЗадач()
	
КонецФункции

#КонецОбласти

#Область Тесты

&Тест
Процедура ФормированиеФайла() Экспорт

	// Дано
	ПодготовитьКаталогТестирования();
	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	Генератор = Поделка.НайтиЖелудь("ГенераторПайплайнаГитлаб"); // ГенераторПайплайнаГитлаб
	Фабрика = Поделка.НайтиЖелудь("ФабрикаЗадач"); // ФабрикаЗадач

	// Когда
	Задача = Фабрика.Новая();
	Задача.Стадия = "Сборка";
	Задача.Наименование = "Конвертация";

	// Тогда
	Генератор.СформироватьПайплайн(ИмяВыходногоФайла());
	Ожидаем.Что(ФС.ФайлСуществует(ИмяВыходногоФайла()));
	
КонецПроцедуры

&Тест
Процедура ОднаСтадия_ПроверкаИмени() Экспорт

	// Дано
	ПодготовитьКаталогТестирования();
	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	Генератор = Поделка.НайтиЖелудь("ГенераторПайплайнаГитлаб"); // ГенераторПайплайнаГитлаб
	Фабрика = Поделка.НайтиЖелудь("ФабрикаЗадач"); // ФабрикаЗадач

	// Когда
	Задача = Фабрика.Новая();
	Задача.Стадия = "build";
	Задача.Наименование = "convert";
	Генератор.СформироватьПайплайн(ИмяВыходногоФайла());

	Пайплайн = ПайплайнРезультат();

	// Тогда
	Ожидаем.Что(Пайплайн["stages"].Количество()).Равно(1);
	Ожидаем.Что(Пайплайн["stages"][0]).Равно("build");
	Ожидаем.Что(Пайплайн["convert"]["stage"]).Равно("build");
	
КонецПроцедуры

#КонецОбласти