
// Представление в секундах "2 seconds"
//
// Параметры:
//   Время - Число - 
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ВСекунды(Время) Экспорт
	Возврат ЧислоВСтроку(Время) + " " + "second" + ?(Время > 1, "s", "");
КонецФункции

// Представление в минутах "2 minutes"
//
// Параметры:
//   Время - Число - 
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ВМинуты(Время) Экспорт
	Возврат ЧислоВСтроку(Время) + " " + "minute" + ?(Время > 1, "s", "");
КонецФункции

// Представление в часах "2 hours"
//
// Параметры:
//   Время - Число - 
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ВЧасы(Время) Экспорт
	Возврат ЧислоВСтроку(Время) + " " + "hour" + ?(Время > 1, "s", "");
КонецФункции

// Представление в днях "2 days"
//
// Параметры:
//   Время - Число - 
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ВДни(Время) Экспорт
	Возврат ЧислоВСтроку(Время) + " " + "day" + ?(Время > 1, "s", "");
КонецФункции

// Представление в неделях "2 weeks"
//
// Параметры:
//   Время - Число - 
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ВНедели(Время) Экспорт
	Возврат ЧислоВСтроку(Время) + " " + "week" + ?(Время > 1, "s", "");
КонецФункции

// Представление в месяцах "2 months"
//
// Параметры:
//   Время - Число - 
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ВМесяцы(Время) Экспорт
	Возврат ЧислоВСтроку(Время) + " " + "month" + ?(Время > 1, "s", "");
КонецФункции

// Представление в годах "2 years"
//
// Параметры:
//   Время - Число - 
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ВГоды(Время) Экспорт
	Возврат ЧислоВСтроку(Время) + " " + "year" + ?(Время > 1, "s", "");
КонецФункции

// ЧислоВСтроку
//
// Параметры:
//   Число - Число - 
//
//  Возвращаемое значение:
//   Строка -
//
Функция ЧислоВСтроку(Число)
	Возврат Формат(Число, "ЧГ=0");
КонецФункции
