// Действия окружения для environment.action
//
//  Возвращаемое значение:
//   Строка - действие окружения

// Все допустимые действия окружения
//
//  Возвращаемое значение:
//   Массив из Строка -
//
Функция Допустимые() Экспорт

	Допустимые = Новый Массив();
	Допустимые.Добавить("start");
	Допустимые.Добавить("prepare");
	Допустимые.Добавить("stop");
	Допустимые.Добавить("verify");
	Допустимые.Добавить("access");

	Возврат Допустимые;

КонецФункции

// Джоба запускает окружение (по умолчанию), развёртывание создаётся
Функция Запуск() Экспорт
	Возврат "start";
КонецФункции

// Джоба только готовит окружение, развёртывание не создаётся
Функция Подготовка() Экспорт
	Возврат "prepare";
КонецФункции

// Джоба останавливает окружение
Функция Остановка() Экспорт
	Возврат "stop";
КонецФункции

// Джоба только проверяет окружение, развёртывание не создаётся
Функция Проверка() Экспорт
	Возврат "verify";
КонецФункции

// Джоба только получает доступ к окружению, развёртывание не создаётся
Функция Доступ() Экспорт
	Возврат "access";
КонецФункции
