

Функция КонвертацияЕДТВКонфигуратор(КаталогВоркспейса,
		КаталогЕДТ,
		КаталогКонфигуратор,
		ПамятьВГБ = 8) Экспорт
	
	Шаблон = "1cedtcli -data %1 -v -vmargs -Xmx%4g -DdisableFTS=true -command export --project %2 --configuration-files %3";

	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		КаталогЕДТ,
		КаталогКонфигуратор,
		строка(ПамятьВГБ));

КонецФункции

Функция ИмпортПроектаЕДТ(КаталогВоркспейса,
		КаталогЕДТ,
		ПамятьВГБ = 8) Экспорт
	
	Шаблон = "1cedtcli -data %1 -v -vmargs -Xmx%3g -DdisableFTS=true -command import --project %2";

	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		КаталогЕДТ,
		строка(ПамятьВГБ));

КонецФункции

// Скрипт запуска валидации проектов ЕДТ.
// Проекты должны быть заранее импортированы в workspace, например с помощью см. ИмпортПроектаЕДТ()
//
//  Параметры:
//   КаталогВоркспейса - Строка - каталог, содержащий workspace ЕДТ
//   СписокПроектов - Массив из Строка - массив имен проектов ЕДТ для валидации
//   ФайлРезультата - Строка - файл результата валидации
//   ПамятьВГБ - Число - память для запуска
//   ТаймаутВСек - Число - таймаут выполнения
//
//  Возвращаемое значение:
//   Строка
Функция ВалидацияЕДТПоСпискуПроектов(КаталогВоркспейса,
		СписокПроектов,
		ФайлРезультата,
		ПамятьВГБ = 8,
		ТаймаутВСек = 3600) Экспорт
	
	Шаблон = "1cedtcli -data %1 -timeout %2 -v -vmargs -Xmx%3g -DdisableFTS=true -command validate --file %4 --project-name-list [%5]";
	СписокПроектовСтрока = СтрСоединить(СписокПроектов, " ");
	
	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		Формат(ТаймаутВСек, "ЧГ=0"),
		Строка(ПамятьВГБ),
		ФайлРезультата,
		СписокПроектовСтрока);

КонецФункции

// Скрипт запуска валидации проектов ЕДТ по списку каталогов, содержащих проекты
// Импорт проектов произойдёт одновременно с валидацией
//
//  Параметры:
//   КаталогВоркспейса - Строка - каталог, содержащий workspace ЕДТ
//   СписокКаталоговПроектов - Массив из Строка - массив каталогов проектов ЕДТ для валидации
//   ФайлРезультата - Строка - файл результата валидации
//   ПамятьВГБ - Число - память для запуска
//   ТаймаутВСек - Число - таймаут выполнения
//
//  Возвращаемое значение:
//   Строка
Функция ВалидацияЕДТПоСпискуКаталоговПроектов(КаталогВоркспейса,
		СписокКаталоговПроектов,
		ФайлРезультата,
		ПамятьВГБ = 8,
		ТаймаутВСек = 3600) Экспорт
	
	Шаблон = "1cedtcli -data %1 -timeout %2 -v -vmargs -Xmx%3g -DdisableFTS=true -command validate --file %4 --project-list [%5]";
	СписокКаталоговПроектовСтрока = СтрСоединить(СписокКаталоговПроектов, " ");
	
	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		Формат(ТаймаутВСек, "ЧГ=0"),
		Строка(ПамятьВГБ),
		ФайлРезультата,
		СписокКаталоговПроектовСтрока);

КонецФункции