
Функция КонвертацияЕДТВКонфигуратор(КаталогВоркспейса,
		КаталогЕДТ,
		КаталогКонфигуратор,
		ПамятьВГБ = 8) Экспорт
	
	Шаблон = "1cedtcli -data %1 -v -vmargs -Xmx%4g -DdisableFTS=true -command export --project %2 --configuration-files %3";

	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		КаталогЕДТ,
		КаталогКонфигуратор,
		строка(ПамятьВГБ));

КонецФункции

Функция ИмпортПроектаЕДТ(КаталогВоркспейса,
		КаталогЕДТ,
		ПамятьВГБ = 8) Экспорт
	
	Шаблон = "1cedtcli -data %1 -v -vmargs -Xmx%3g -DdisableFTS=true -command import --project %2";

	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		КаталогЕДТ,
		строка(ПамятьВГБ));

КонецФункции

// Скрипт запуска валидации проектов ЕДТ.
// Проекты должны быть заранее импортированы в workspace, например с помощью см. ИмпортПроектаЕДТ()
//
//  Параметры:
//   КаталогВоркспейса - Строка - каталог, содержащий workspace ЕДТ
//   СписокПроектов - Массив из Строка - массив имен проектов ЕДТ для валидации
//   ФайлРезультата - Строка - файл результата валидации
//   ПамятьВГБ - Число - память для запуска
//   ТаймаутВСек - Число - таймаут выполнения
//
//  Возвращаемое значение:
//   Строка
Функция ВалидацияЕДТПоСпискуПроектов(КаталогВоркспейса,
		СписокПроектов,
		ФайлРезультата,
		ПамятьВГБ = 8,
		ТаймаутВСек = 3600) Экспорт
	
	Шаблон = "1cedtcli -data %1 -timeout %2 -v -vmargs -Xmx%3g -DdisableFTS=true -command validate --file %4 --project-name-list [%5]";
	СписокПроектовСтрока = СтрСоединить(СписокПроектов, " ");
	
	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		Формат(ТаймаутВСек, "ЧГ=0"),
		Строка(ПамятьВГБ),
		ФайлРезультата,
		СписокПроектовСтрока);

КонецФункции

// Скрипт запуска валидации проектов ЕДТ по списку каталогов, содержащих проекты
// Импорт проектов произойдёт одновременно с валидацией
//
//  Параметры:
//   КаталогВоркспейса - Строка - каталог, содержащий workspace ЕДТ
//   СписокКаталоговПроектов - Массив из Строка - массив каталогов проектов ЕДТ для валидации
//   ФайлРезультата - Строка - файл результата валидации
//   ПамятьВГБ - Число - память для запуска
//   ТаймаутВСек - Число - таймаут выполнения
//
//  Возвращаемое значение:
//   Строка
Функция ВалидацияЕДТПоСпискуКаталоговПроектов(КаталогВоркспейса,
		СписокКаталоговПроектов,
		ФайлРезультата,
		ПамятьВГБ = 8,
		ТаймаутВСек = 3600) Экспорт
	
	Шаблон = "1cedtcli -data %1 -timeout %2 -v -vmargs -Xmx%3g -DdisableFTS=true -command validate --file %4 --project-list [%5]";
	СписокКаталоговПроектовСтрока = СтрСоединить(СписокКаталоговПроектов, " ");
	
	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		Формат(ТаймаутВСек, "ЧГ=0"),
		Строка(ПамятьВГБ),
		ФайлРезультата,
		СписокКаталоговПроектовСтрока);

КонецФункции

// vrunner init-dev [--ibcmd] --ibconnection <СтрокаПодключения>
//
// Параметры:
//   СтрокаПодключения - Строка - Например: /Fbuild/ib
//   ИспользоватьАвтономныйСервер - Булево - Флаг --ibcmd
//
//  Возвращаемое значение:
//   Строка - 
//
Функция СозданиеБазы(СтрокаПодключения, ИспользоватьАвтономныйСервер = Истина) Экспорт
	
	Шаблон = "vrunner init-dev %1 --ibconnection %2";

	Возврат СтрШаблон(Шаблон,
		?(ИспользоватьАвтономныйСервер, "--ibcmd", ""),
		СтрокаПодключения);

КонецФункции

// vrunner compile -c [--ibcmd] --ibconnection <СтрокаПодключения> -s <КаталогИсходниковВФорматеКонфигуратора>
//
// Параметры:
//   СтрокаПодключения - Строка - Например: /Fbuild/ib
//   КаталогИсходников - Строка - Например: build/src
//   ИспользоватьАвтономныйСервер - Булево - Флаг --ibcmd
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ЗагрузитьКонфигурациюИзФайлов(СтрокаПодключения,
		КаталогИсходников,
		ИспользоватьАвтономныйСервер = Истина) Экспорт
	
	Шаблон = "vrunner compile -c %1 --ibconnection %2 -s %3";

	Возврат СтрШаблон(Шаблон,
		?(ИспользоватьАвтономныйСервер, "--ibcmd", ""),
		СтрокаПодключения,
		КаталогИсходников);

КонецФункции

// vrunner compileext [--ibcmd] --ibconnection <СтрокаПодключения> <КаталогИсходниковВФорматеКонфигуратора> <ИмяРасширения>
//
// Параметры:
//   СтрокаПодключения - Строка - Например: /Fbuild/ib
//   КаталогИсходников - Строка - Например: build/src
//   ИмяРасширения - Строка - Например: YAXUNIT
//   ИспользоватьАвтономныйСервер - Булево - Флаг --ibcmd
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ЗагрузитьРасширениеИзФайлов(СтрокаПодключения,
		КаталогИсходников,
		ИмяРасширения,
		ИспользоватьАвтономныйСервер = Истина) Экспорт
	
	Шаблон = "vrunner compileext %1 --ibconnection %2 %3 %4";

	Возврат СтрШаблон(Шаблон,
		?(ИспользоватьАвтономныйСервер, "--ibcmd", ""),
		СтрокаПодключения,
		КаталогИсходников,
		ИмяРасширения);

КонецФункции

// vrunner updatedb [--ibcmd] --ibconnection <СтрокаПодключения>
//
// Параметры:
//   СтрокаПодключения - Строка - Например: /Fbuild/ib
//   ИспользоватьАвтономныйСервер - Булево - Флаг --ibcmd
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ОбновитьКонфигурациюБД(СтрокаПодключения,
		ИспользоватьАвтономныйСервер = Истина) Экспорт
	
	Шаблон = "vrunner updatedb %1 --ibconnection %2";

	Возврат СтрШаблон(Шаблон,
		?(ИспользоватьАвтономныйСервер, "--ibcmd", ""),
		СтрокаПодключения);

КонецФункции

// ibcmd extension --database-path=<ПолныйПутьКБазе> update --name=<ИмяРасширения> <НастройкаФлагов>
//
// Параметры:
//   ПолныйПутьКБазе - Строка - /bases/myproj/ib
//   ИмяРасширения - Строка - YAXUNIT
//   НастройкаФлагов - Строка - --safe-mode=no --unsafe-action-protection=no
//
//  Возвращаемое значение:
//   Строка - 
//
Функция НастройкаФлаговРасширения(ПолныйПутьКБазе,
		ИмяРасширения,
		НастройкаФлагов = "--safe-mode=no --unsafe-action-protection=no") Экспорт
	Шаблон = "ibcmd extension --database-path=%1 update --name=%2 %3";

	Возврат СтрШаблон(Шаблон,
		ПолныйПутьКБазе,
		ИмяРасширения,
		НастройкаФлагов);
КонецФункции

// vrunner compile [--ibcmd] -s <КаталогИсходниковВФорматеКонфигуратора> -o <ПутьКФайлу>
//
// Параметры:
//   КаталогИсходников - Строка - Например: build/cf
//   ПутьКФайлу - Строка - Например: build/conf.cf
//   ИспользоватьАвтономныйСервер - Булево - Флаг --ibcmd
//
//  Возвращаемое значение:
//   Строка - 
//
Функция СобратьКонфигурациюИзФайлов(КаталогИсходников,
		ПутьКФайлу,
		ИспользоватьАвтономныйСервер = Истина) Экспорт
	
	Шаблон = "vrunner compile %1 -s %2 -o %3";

	Возврат СтрШаблон(Шаблон,
		?(ИспользоватьАвтономныйСервер, "--ibcmd", ""),
		КаталогИсходников,
		ПутьКФайлу);

КонецФункции

// vrunner run [--ibcmd] --ibconnection <СтрокаПодключения>
// 		--command "ЗапуститьОбновлениеИнформационнойБазы;ЗавершитьРаботуСистемы;"
//		--execute "<ПутьДоОбработкиЗакрытияПредприятия>"
//
// Параметры:
//   СтрокаПодключения - Строка - Например: /Fbuild/ib
//   ПутьДоОбработки - Строка - Например: $OSCRIPTPATH/lib/vanessa-runner/epf/ЗакрытьПредприятие.epf
//   ИспользоватьАвтономныйСервер - Булево - Флаг --ibcmd
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ОбновитьБазуВРежимеПредприятия(СтрокаПодключения, ПутьДоОбработки,
		ИспользоватьАвтономныйСервер = Истина) Экспорт
	Шаблон = "vrunner run %1 --ibconnection %2 "
		+ "--command ""ЗапуститьОбновлениеИнформационнойБазы;ЗавершитьРаботуСистемы;"" "
		+ "--execute ""%3""";

	Возврат СтрШаблон(Шаблон,
		?(ИспользоватьАвтономныйСервер, "--ibcmd", ""),
		СтрокаПодключения,
		ПутьДоОбработки);

КонецФункции

// vrunner run [--ibsrv] --ibconnection <СтрокаПодключения> --nocacheuse
// 		--command "RunUnitTests=<ФайлНастроекЯксЮнит>"
//
// Параметры:
//   СтрокаПодключения - Строка - Например: /Fbuild/ib
//   ФайлНастроекЯксЮнит - Строка - Например: yaxunit_settings.json
//   ИспользоватьАвтономныйСервер - Булево - Флаг --ibsrv
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ЗапускТестовЯксЮнит(СтрокаПодключения, ФайлНастроекЯксЮнит,
		ИспользоватьАвтономныйСервер = Истина) Экспорт

	Шаблон = "vrunner run %1 --nocacheuse --ibconnection %2 "
		+ "--command ""RunUnitTests=%3""";

	Возврат СтрШаблон(Шаблон,
		?(ИспользоватьАвтономныйСервер, "--ibsrv", ""),
		СтрокаПодключения,
		ФайлНастроекЯксЮнит);

КонецФункции

// vrunner run [--ibsrv] --ibconnection <СтрокаПодключения> --nocacheuse
// 		--additional /testmanage
//		--execute "<ПутьОбработкиВА>"
// 		--command "StartFeaturePlayer;VAParams=<ФайлПараметровВА>;WorkspaceRoot=<КореньПроекта>"
//
// Параметры:
//   СтрокаПодключения - Строка - Например: /Fbuild/ib
//   ФайлПараметровВА - Строка - Например: VAParams.json
//   ПутьОбработкиВА - Строка - Например: $OSCRIPTPATH/lib/vanessa-automation-single/vanessa-automation-single.epf
//   КореньПроекта - Строка - Например: /proj/my (или текущий каталог $(pwd))
//   ИспользоватьАвтономныйСервер - Булево - Флаг --ibsrv
//
//  Возвращаемое значение:
//   Строка - 
//
Функция ЗапускТестовВА(СтрокаПодключения, ФайлПараметровВА, ПутьОбработкиВА, КореньПроекта,
		ИспользоватьАвтономныйСервер = Истина) Экспорт

	Шаблон = "vrunner run %1 --nocacheuse --additional /testmanager --ibconnection %2 "
		+ "--execute ""%3"" "
		+ "--command ""StartFeaturePlayer;VAParams=%4;WorkspaceRoot=%5""";

	Возврат СтрШаблон(Шаблон,
		?(ИспользоватьАвтономныйСервер, "--ibsrv", ""),
		СтрокаПодключения,
		ПутьОбработкиВА,
		ФайлПараметровВА,
		КореньПроекта);

КонецФункции

// echo "-- $(date '+%Y-%m-%d %H:%M:%S')" <ТекстСообщения>
//
// Параметры:
//   ТекстСообщения - Строка - Например: "Сборка конфигурации"
//  Возвращаемое значение:
//   Строка - 
//
Функция ЛогЭхоЛинукс(ТекстСообщения = "") Экспорт
	Возврат "echo ""-- $(date '+%Y-%m-%d %H:%M:%S')"" " + ТекстСообщения;
КонецФункции

// 
//
// Параметры:
//   ФайлРезультатаВалидацииЕДТ - Строка
//   ФайлРезультатаВалидацииЕДТДляСонара - Строка
//   СписокКаталоговПроектов - Массив из Строка - список каталогов проектов, для которых выполнялась валидация ЕДТ
//   ФорматСонара10_3 - Булево - Использовать новый формат sonarqube
//  Возвращаемое значение:
//   Строка
//
Функция ПреобразоватьЗамечанияЕДТЧерезСтеби(ФайлРезультатаВалидацииЕДТ, ФайлРезультатаВалидацииЕДТДляСонара,
	СписокКаталоговПроектов, ФорматСонара10_3 = Истина) Экспорт
	Шаблон = "stebi convert %4 -r %1 %2 %3";
	СписокКаталоговПроектовСтрока = СтрСоединить(СписокКаталоговПроектов, " ");

	Возврат СтрШаблон(Шаблон,
		ФайлРезультатаВалидацииЕДТ,
		ФайлРезультатаВалидацииЕДТДляСонара,
		СписокКаталоговПроектовСтрока,
		?(ФорматСонара10_3, "--Format Generic_Issue_10_3", ""));
КонецФункции
