

Функция КонвертацияЕДТВКонфигуратор(КаталогВоркспейса,
		КаталогЕДТ,
		КаталогКонфигуратор,
		ПамятьВГБ = 8) Экспорт
	
	Шаблон = "1cedtcli -data %1 -v -vmargs -Xmx%4g -DdisableFTS=true -command export --project %2 --configuration-files %3";

	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		КаталогЕДТ,
		КаталогКонфигуратор,
		строка(ПамятьВГБ));

КонецФункции

Функция ИмпортПроектаЕДТ(КаталогВоркспейса,
		КаталогЕДТ,
		ПамятьВГБ = 8) Экспорт
	
	Шаблон = "1cedtcli -data %1 -v -vmargs -Xmx%3g -DdisableFTS=true -command import --project %2";

	Возврат СтрШаблон(Шаблон,
		КаталогВоркспейса,
		КаталогЕДТ,
		строка(ПамятьВГБ));

КонецФункции