
// Ручной запуск
//
//  Возвращаемое значение:
//   Строка - manual
//
Функция РучнойЗапуск() Экспорт

	Возврат "manual";
	
КонецФункции

// Всегда
//
//  Возвращаемое значение:
//   Строка - always
//
Функция Всегда() Экспорт

	Возврат "always";
	
КонецФункции

// При успехе
//
//  Возвращаемое значение:
//   Строка - on_success
//
Функция ПриУспехе() Экспорт

	Возврат "on_success";
	
КонецФункции

// При неудаче
//
//  Возвращаемое значение:
//   Строка - on_failure
//
Функция ПриНеудаче() Экспорт

	Возврат "on_failure";
	
КонецФункции

// Никогда
//
//  Возвращаемое значение:
//   Строка - never
//
Функция Никогда() Экспорт

	Возврат "never";
	
КонецФункции