
&Аргумент(Имя = "OUT", Описание = "Файл сохранения pipeline например pipeline.yml")
&ТСтрока 
Перем ПутьСохранения; // Строка

&Пластилин
Перем ГенераторПайплайнаГитлаб; // ГенераторПайплайнаГитлаб

&КомандаПриложения(Имя = "gitlab", Описание = "Генерация pipeline для Gitlab")
Процедура ПриСозданииОбъекта()
		
КонецПроцедуры

&ВыполнениеКоманды
Процедура ВывестиРезультатСложения() Экспорт

	Сообщить("Генерация pipeline: " + ПутьСохранения);

	ГенераторПайплайнаГитлаб.СформироватьПайплайн(ПутьСохранения);

КонецПроцедуры
