#Использовать oscript-yaml

&Пластилин(Значение = "Задача", Тип = "Массив")
Перем ЗадачиПользователя; // Массив из Произвольный

&Пластилин
Перем ФабрикаЗадач; // ФабрикаЗадач

&Пластилин
Перем ОписаниеПайплайна; // ОписаниеПайплайна

&Желудь
Процедура ПриСозданииОБъекта()
	
КонецПроцедуры

Процедура СформироватьПайплайн(ПутьКФайлу) Экспорт

	Задачи = ФабрикаЗадач.Задачи();

	Парсер = Новый ПарсерYaml();

	Пайплайн = Новый Соответствие();

	ДобавитьДефолты(Пайплайн);

	Стадии = Новый Массив();

	Пайплайн.Вставить("stages", Стадии);

	Для Каждого ОписаниеЗадачи Из Задачи Цикл

		Если ОписаниеЗадачи = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ДобавитьВМассивБезДублей(Стадии, ОписаниеЗадачи.Стадия);

		ОписаниеДжобы = СформироватьДжоб(ОписаниеЗадачи);

		Пайплайн.Вставить(ОписаниеЗадачи.Наименование, ОписаниеДжобы);

	КонецЦикла;
	
	СтрокаYAML = Парсер.ЗаписатьYaml(Пайплайн);

	Сообщить(СтрокаYAML);

	ЗаписатьТекстВФайл(ПутьКФайлу, СтрокаYAML);

КонецПроцедуры

Процедура ДобавитьДефолты(Пайплайн)

	Дефолты = Новый Соответствие();

	Если ОписаниеПайплайна.ПередСкрипты.Количество() > 0 Тогда
		Дефолты.Вставить("before_script", ОписаниеПайплайна.ПередСкрипты);
	КонецЕсли;

	Если ОписаниеПайплайна.ПослеСкрипты.Количество() > 0 Тогда
		Дефолты.Вставить("after_script", ОписаниеПайплайна.ПослеСкрипты);
	КонецЕсли;

	Если Дефолты.Количество() > 0 Тогда
		Пайплайн.Вставить("default", Дефолты);
	КонецЕсли;

КонецПроцедуры

// <Описание функции>
//
// Параметры:
//   ОписаниеЗадачи - ОписаниеЗадачи - <описание параметра>
//
//  Возвращаемое значение:
//   Структура - <описание возвращаемого значения>
//
Функция СформироватьДжоб(ОписаниеЗадачи)

	ТекущаяДжоба = Новый Соответствие();

	ТекущаяДжоба.Вставить("when", ОписаниеЗадачи.Когда);

	ТекущаяДжоба.Вставить("stage", ОписаниеЗадачи.Стадия);

	Если НЕ ПустаяСтрока(ОписаниеЗадачи.Таймаут) Тогда
		ТекущаяДжоба.Вставить("timeout", ОписаниеЗадачи.Таймаут);
	КонецЕсли;

	ДобавитьОбраз(ТекущаяДжоба, ОписаниеЗадачи);

	ТекущаяДжоба.Вставить("tags", ОписаниеЗадачи.ТегиРаннера);

	Если ОписаниеЗадачи.Нуждается.Количество() > 0 Тогда
		ТекущаяДжоба.Вставить("needs", ОписаниеЗадачи.Нуждается);
	КонецЕсли;

	Если ОписаниеЗадачи.Зависимости.Количество() > 0 Тогда
		ТекущаяДжоба.Вставить("dependencies", ОписаниеЗадачи.Зависимости);
	КонецЕсли;

	ДобавитьПравила(ТекущаяДжоба, ОписаниеЗадачи);

	ДобавитьАртефакты(ТекущаяДжоба, ОписаниеЗадачи);

	Если ОписаниеЗадачи.ПередСкрипты.Количество() > 0 Тогда
		ТекущаяДжоба.Вставить("before_script", ОписаниеЗадачи.ПередСкрипты);
	КонецЕсли;

	ДобавитьКэш(ТекущаяДжоба, ОписаниеЗадачи);

	Если ОписаниеЗадачи.РазрешитьПадение Тогда
		ТекущаяДжоба.Вставить("allow_failure", Истина);
	КонецЕсли;

	Если ОписаниеЗадачи.Прерываемый Тогда
		ТекущаяДжоба.Вставить("interruptible", Истина);
	КонецЕсли;

	ТекущаяДжоба.Вставить("script", ОписаниеЗадачи.Скрипты);

	Если ОписаниеЗадачи.ПослеСкрипты.Количество() > 0 Тогда
		ТекущаяДжоба.Вставить("after_script", ОписаниеЗадачи.ПослеСкрипты);
	КонецЕсли;

	Возврат ТекущаяДжоба;
КонецФункции

// <Описание процедуры>
//
// Параметры:
//   ОписаниеДжобы - Соответствие - <описание параметра>
//   ОписаниеЗадачи - ОписаниеЗадачи - <описание параметра>
//
Процедура ДобавитьОбраз(ОписаниеДжобы, ОписаниеЗадачи)
	
	Если ОписаниеЗадачи.Образ.Имя = "" Тогда
		Возврат;
	КонецЕсли;

	ОписаниеОбраза = Новый Структура("name", ОписаниеЗадачи.Образ.Имя);

	Команда = ОписаниеЗадачи.Образ.Энтрипоинт();
	Если Команда.Количество() > 0 Тогда
		ОписаниеОбраза.Вставить("entrypoint", Команда);
	КонецЕсли;

	ОписаниеДжобы.Вставить("image", ОписаниеОбраза);

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//   ОписаниеДжобы - Соответствие - <описание параметра>
//   ОписаниеЗадачи - ОписаниеЗадачи - <описание параметра>
//
Процедура ДобавитьПравила(ОписаниеДжобы, ОписаниеЗадачи)
	Если ОписаниеЗадачи.Правила.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПравилаПоКонтракту = Новый Массив();

	Для Каждого Правило Из ОписаниеЗадачи.Правила Цикл
		ПравилоПоКонтракту = Новый Соответствие();

		Если НЕ ПустаяСтрока(Правило.Когда) Тогда
			ПравилоПоКонтракту.Вставить("when", Правило.Когда);
		КонецЕсли;

		Если НЕ ПустаяСтрока(Правило.Условие) Тогда
			ПравилоПоКонтракту.Вставить("if", Правило.Условие);
		КонецЕсли;

		Если Правило.Изменения.Количество() > 0 Тогда
			ПравилоПоКонтракту.Вставить("changes", Правило.Изменения);
		КонецЕсли;

		ПравилаПоКонтракту.Добавить(ПравилоПоКонтракту);

	КонецЦикла;

	ОписаниеДжобы.Вставить("rules", ПравилаПоКонтракту);
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//   ОписаниеДжобы - Соответствие - <описание параметра>
//   ОписаниеЗадачи - ОписаниеЗадачи - <описание параметра>
//
Процедура ДобавитьАртефакты(ОписаниеДжобы, ОписаниеЗадачи)

	Если ОписаниеЗадачи.Артефакты.Пути.Количество() > 0 Тогда
		Артефакт = Новый Структура("when, paths",
			ОписаниеЗадачи.Артефакты.Когда,
			ОписаниеЗадачи.Артефакты.Пути);

		Если НЕ ПустаяСтрока(ОписаниеЗадачи.Артефакты.ВремяХранения) Тогда
			Артефакт.Вставить("expire_in", ОписаниеЗадачи.Артефакты.ВремяХранения)
		КонецЕсли;
		
		Если ОписаниеЗадачи.Артефакты.ОтчетыJUnit.Количество() > 0 Тогда
			Артефакт.Вставить("reports", Новый Структура("junit", ОписаниеЗадачи.Артефакты.ОтчетыJUnit));
		КонецЕсли;

		ОписаниеДжобы.Вставить("artifacts", Артефакт);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьКэш(ОписаниеДжобы, ОписаниеЗадачи)

	Если ОписаниеЗадачи.Кэш.Пути.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Кэш = Новый Соответствие();
	Кэш.Вставить("paths", ОписаниеЗадачи.Кэш.Пути);

	Если ОписаниеЗадачи.Кэш.КлючПоФайлам.Количество() > 0 Тогда
		ОбъектКлюча = Новый Соответствие();
		ОбъектКлюча.Вставить("files", ОписаниеЗадачи.Кэш.КлючПоФайлам);
		Если НЕ ПустаяСтрока(ОписаниеЗадачи.Кэш.ПрефиксКлюча) Тогда
			ОбъектКлюча.Вставить("prefix", ОписаниеЗадачи.Кэш.ПрефиксКлюча);
		КонецЕсли;
		Кэш.Вставить("key", ОбъектКлюча);
	ИначеЕсли ОписаниеЗадачи.Кэш.КлючПоКоммитам.Количество() > 0 Тогда
		ОбъектКлюча = Новый Соответствие();
		ОбъектКлюча.Вставить("files_commits", ОписаниеЗадачи.Кэш.КлючПоКоммитам);
		Если НЕ ПустаяСтрока(ОписаниеЗадачи.Кэш.ПрефиксКлюча) Тогда
			ОбъектКлюча.Вставить("prefix", ОписаниеЗадачи.Кэш.ПрефиксКлюча);
		КонецЕсли;
		Кэш.Вставить("key", ОбъектКлюча);
	ИначеЕсли НЕ ПустаяСтрока(ОписаниеЗадачи.Кэш.Ключ) Тогда
		Кэш.Вставить("key", ОписаниеЗадачи.Кэш.Ключ);
	КонецЕсли;

	Кэш.Вставить("when", ОписаниеЗадачи.Кэш.Когда);
	Кэш.Вставить("policy", ОписаниеЗадачи.Кэш.Политика);

	Если ОписаниеЗадачи.Кэш.Неотслеживаемые Тогда
		Кэш.Вставить("untracked", Истина);
	КонецЕсли;

	Если ОписаниеЗадачи.Кэш.БезЗащиты Тогда
		Кэш.Вставить("unprotect", Истина);
	КонецЕсли;

	Если ОписаниеЗадачи.Кэш.РезервныеКлючи.Количество() > 0 Тогда
		Кэш.Вставить("fallback_keys", ОписаниеЗадачи.Кэш.РезервныеКлючи);
	КонецЕсли;

	ОписаниеДжобы.Вставить("cache", Кэш);
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//   Массив - Массив - <описание параметра>
//   Значение - Произвольный - <описание параметра>
//
Процедура ДобавитьВМассивБезДублей(Массив, Значение)
	Если Массив.Найти(Значение) = Неопределено Тогда
		Массив.Добавить(Значение);
	КонецЕсли;
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//   ПутьКФайлу - Строка - <описание параметра>
//   Текст - Строка - <описание параметра>
//
Процедура ЗаписатьТекстВФайл(ПутьКФайлу, Текст)
	ЗаписьТекста = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8NoBOM);
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();
КонецПроцедуры