#Использовать oscript-yaml

&Пластилин(Значение = "Задача", Тип = "Массив")
Перем ЗадачиПользователя; // Массив из Произвольный

&Пластилин
Перем ФабрикаЗадач; // ФабрикаЗадач

&Желудь
Процедура ПриСозданииОБъекта()
	
КонецПроцедуры

Процедура СформироватьПайплайн(ПутьКФайлу) Экспорт

	Задачи = ФабрикаЗадач.Задачи();

	Парсер = Новый ПарсерYaml();

	Пайплайн = Новый Соответствие();

	Стадии = Новый Массив();

	Пайплайн.Вставить("stages", Стадии);

	Для Каждого ОписаниеЗадачи Из Задачи Цикл

		Если ОписаниеЗадачи = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ДобавитьВМассивБезДублей(Стадии, ОписаниеЗадачи.Стадия);

		ОписаниеДжобы = СформироватьДжоб(ОписаниеЗадачи);

		Пайплайн.Вставить(ОписаниеЗадачи.Наименование, ОписаниеДжобы);

	КонецЦикла;
	
	СтрокаYAML = Парсер.ЗаписатьYaml(Пайплайн);

	Сообщить(СтрокаYAML);

	ЗаписатьТекстВФайл(ПутьКФайлу, СтрокаYAML);

КонецПроцедуры

// <Описание функции>
//
// Параметры:
//   ОписаниеЗадачи - ОписаниеЗадачи - <описание параметра>
//
//  Возвращаемое значение:
//   Структура - <описание возвращаемого значения>
//
Функция СформироватьДжоб(ОписаниеЗадачи)

	ТекущаяДжоба = Новый Соответствие();

	ТекущаяДжоба.Вставить("when", ОписаниеЗадачи.Когда);

	ТекущаяДжоба.Вставить("stage", ОписаниеЗадачи.Стадия);

	ТекущаяДжоба.Вставить("image", Новый Структура("name", ОписаниеЗадачи.ИмяОбраза));

	Теги = Новый Массив();
	Теги.Добавить(ОписаниеЗадачи.ТегРаннера);
	ТекущаяДжоба.Вставить("tags", Теги);

	ДобавитьПравила(ТекущаяДжоба, ОписаниеЗадачи);

	ДобавитьАртефакты(ТекущаяДжоба, ОписаниеЗадачи);

	ТекущаяДжоба.Вставить("script", ОписаниеЗадачи.Скрипты);

	Возврат ТекущаяДжоба;
КонецФункции

// <Описание процедуры>
//
// Параметры:
//   ОписаниеДжобы - Соответствие - <описание параметра>
//   ОписаниеЗадачи - ОписаниеЗадачи - <описание параметра>
//
Процедура ДобавитьПравила(ОписаниеДжобы, ОписаниеЗадачи)
	Если ОписаниеЗадачи.Правила.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПравилаПоКонтракту = Новый Массив();

	Для Каждого Правило Из ОписаниеЗадачи.Правила Цикл
		ПравилоПоКонтракту = Новый Соответствие();

		Если НЕ ПустаяСтрока(Правило.Когда) Тогда
			ПравилоПоКонтракту.Вставить("when", Правило.Когда);
		КонецЕсли;

		Если НЕ ПустаяСтрока(Правило.Условие) Тогда
			ПравилоПоКонтракту.Вставить("if", Правило.Условие);
		КонецЕсли;

		Если Правило.Изменения.Количество() > 0 Тогда
			ПравилоПоКонтракту.Вставить("changes", Правило.Изменения);
		КонецЕсли;

		ПравилаПоКонтракту.Добавить(ПравилоПоКонтракту);

	КонецЦикла;

	ОписаниеДжобы.Вставить("rules", ПравилаПоКонтракту);
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//   ОписаниеДжобы - Соответствие - <описание параметра>
//   ОписаниеЗадачи - ОписаниеЗадачи - <описание параметра>
//
Процедура ДобавитьАртефакты(ОписаниеДжобы, ОписаниеЗадачи)

	Если ОписаниеЗадачи.Артефакты.Пути.Количество() > 0 Тогда
		Артефакт = Новый Структура("when, paths",
			ОписаниеЗадачи.Артефакты.Когда,
			ОписаниеЗадачи.Артефакты.Пути);

		Если НЕ ПустаяСтрока(ОписаниеЗадачи.Артефакты.ВремяХранения) Тогда
			Артефакт.Вставить("expire_in", ОписаниеЗадачи.Артефакты.ВремяХранения)
		КонецЕсли;
		
		Если ОписаниеЗадачи.Артефакты.ОтчетыJUnit.Количество() > 0 Тогда
			Артефакт.Вставить("reports", Новый Структура("junit", ОписаниеЗадачи.Артефакты.ОтчетыJUnit));
		КонецЕсли;

		ОписаниеДжобы.Вставить("artifacts", Артефакт);
	КонецЕсли;
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//   Массив - Массив - <описание параметра>
//   Значение - Произвольный - <описание параметра>
//
Процедура ДобавитьВМассивБезДублей(Массив, Значение)
	Если Массив.Найти(Значение) = Неопределено Тогда
		Массив.Добавить(Значение);
	КонецЕсли;
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//   ПутьКФайлу - Строка - <описание параметра>
//   Текст - Строка - <описание параметра>
//
Процедура ЗаписатьТекстВФайл(ПутьКФайлу, Текст)
	ЗаписьТекста = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8NoBOM);
	ЗаписьТекста.Записать(Текст);
	ЗаписьТекста.Закрыть();
КонецПроцедуры