
Перем КаталогПайплайна; // Строка

&Заготовка
Процедура ПриСозданииОбъекта(&Деталька(Значение = "pipeliner.КаталогПайплайна", ЗначениеПоУмолчанию = "./pipeline") _КаталогПайплайна)
	КаталогПайплайна = _КаталогПайплайна;	
КонецПроцедуры

Процедура ПриИнициализацииПоделки(Поделка) Экспорт

	ДобавитьЖелудиПайплайна();
	
КонецПроцедуры

Процедура ДобавитьЖелудиПайплайна()

	Файлы = НайтиФайлы(КаталогПайплайна, "*.os", Истина);
	Для Каждого Файл Из Файлы Цикл
		
		Сообщить("Загружена стадия: " + Файл.ИмяБезРасширения);
		
		ПодключитьСценарий(Файл.ПолноеИмя, Файл.ИмяБезРасширения);	

	КонецЦикла;

КонецПроцедуры