// BSLLS:ExportVariables-off

Перем Имя Экспорт; // Строка
Перем Алиас Экспорт; // Строка
Перем Энтрипоинт; // Массив из Строка
Перем Команда; // Массив из Строка
Перем Переменные Экспорт; // Соответствие

&Желудь
&Характер("Компанейский")
Процедура ПриСозданииОбъекта()

	Имя = "";
	Алиас = "";
	Энтрипоинт = Новый Массив();
	Команда = Новый Массив();
	Переменные = Новый Соответствие();

КонецПроцедуры

Процедура ДобавитьКомандуЭнтрипоинт(ЗначениеКоманды) Экспорт
	Энтрипоинт.Добавить(ЗначениеКоманды);
КонецПроцедуры

Функция Энтрипоинт() Экспорт
	Возврат Энтрипоинт;
КонецФункции

Процедура ДобавитьКоманду(ЗначениеКоманды) Экспорт
	Команда.Добавить(ЗначениеКоманды);
КонецПроцедуры

Функция ПолучитьКоманду() Экспорт
	Возврат Команда;
КонецФункции

Процедура ДобавитьПеременную(ИмяПеременной, Значение) Экспорт
	Переменные.Вставить(ИмяПеременной, Значение);
КонецПроцедуры
