// BSLLS:ExportVariables-off

Перем Имя Экспорт; // Строка
Перем Энтрипоинт; // Массив из Строка

&Желудь
&Характер("Компанейский")
Процедура ПриСозданииОбъекта()

	Имя = "";
	Энтрипоинт = Новый Массив();

КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//   Команда - Строка - 
//
Процедура ДобавитьКомандуЭнтрупоинт(Команда) Экспорт
	Энтрипоинт.Добавить(Команда);
КонецПроцедуры

// <Описание функции>
//
//  Возвращаемое значение:
//   Массив из Строка -
//
Функция Энтрипоинт() Экспорт
	Возврат Энтрипоинт;
КонецФункции