// BSLLS:ExportVariables-off

Перем ПередСкрипты Экспорт; // Массив из Строка
Перем ПослеСкрипты Экспорт; // Массив из Строка
Перем Переменные Экспорт; // Соответствие
Перем ШаблонПокрытия Экспорт; // Строка - регекс поиска процента покрытия в логах джоб (top-level coverage)

&Желудь
Процедура ПриСозданииОбъекта()

	ПередСкрипты = Новый Массив();
	ПослеСкрипты = Новый Массив();
	Переменные = Новый Соответствие();
	ШаблонПокрытия = "";

КонецПроцедуры

Процедура ДобавитьПередСкрипт(Команда) Экспорт

	ПередСкрипты.Добавить(Команда);

КонецПроцедуры

Процедура ДобавитьПослеСкрипт(Команда) Экспорт

	ПослеСкрипты.Добавить(Команда);

КонецПроцедуры

// Добавляет переменную окружения пайплайна (глобальная для всех джоб)
//
// Параметры:
//   Имя - Строка - имя переменной
//   Значение - Строка - значение
//
Процедура ДобавитьПеременную(Имя, Значение) Экспорт
	Переменные.Вставить(Имя, Значение);
КонецПроцедуры
