// BSLLS:ExportVariables-off

Перем Наименование Экспорт; // Строка
Перем Стадия Экспорт; // Строка
Перем ТегРаннера Экспорт; // Строка
Перем ИмяОбраза Экспорт; // Строка
Перем Когда Экспорт; // Строка
Перем Правила Экспорт; // Массив из см. НовыйПравило()

&Пластилин("ОписаниеАртефактов")
Перем Артефакты Экспорт; // ОписаниеАртефактов

Перем Скрипты Экспорт; // Массив из Строка

&Желудь
&Характер("Компанейский")
Процедура ПриСозданииОбъекта()

	Правила = Новый Массив(); // Массив из см. НовыйПравило()

	ПриУспехе();

	Наименование = "";
	Стадия = "";
	ТегРаннера = "";
	ИмяОбраза = "";

	Скрипты = Новый Массив();
КонецПроцедуры

// Добавляет правло (условие работы джобы)
//
// Параметры:
//   Условие - Строка - Например $CI_PIPELINE_SOURCE == "merge_request_event"
//   Когда - Строка - см. СобытияПайплайна
//   Изменения - Массив из Строка, Неопределено -
//
Процедура ДобавитьПравило(Условие = "", Когда = "", Изменения = Неопределено) Экспорт
	
	ОписаниеПравила = НовыйПравило();
	ОписаниеПравила.Условие = Условие;
	ОписаниеПравила.Когда = Когда;
	Если НЕ Изменения = Неопределено Тогда
		ОписаниеПравила.Изменения = Изменения;
	КонецЕсли;

	Правила.Добавить(ОписаниеПравила);

КонецПроцедуры

Процедура РучнойЗапуск() Экспорт

	Когда = СобытияПайплайна.РучнойЗапуск();
	
КонецПроцедуры

Процедура Всегда() Экспорт

	Когда = СобытияПайплайна.Всегда();
	
КонецПроцедуры

Процедура ПриУспехе() Экспорт

	Когда = СобытияПайплайна.ПриУспехе();
	
КонецПроцедуры

Процедура ПриНеудаче() Экспорт

	Когда = СобытияПайплайна.ПриНеудаче();
	
КонецПроцедуры

Процедура Никогда() Экспорт

	Когда = СобытияПайплайна.Никогда();
	
КонецПроцедуры

// Описание нового правила
//
//  Возвращаемое значение:
//  Структура:
//  * Условие - Строка -
//  * Когда - Строка -
//  * Изменения - Массив из Строка -
//
Функция НовыйПравило() Экспорт
	Возврат Новый Структура("Условие, Когда, Изменения", "", "", Новый Массив());
КонецФункции