// BSLLS:ExportVariables-off

Перем ВремяХранения Экспорт; // Строка
Перем Когда Экспорт; // Строка
Перем Пути Экспорт; // Массив из Строка
Перем ОтчетыJUnit Экспорт; // Массив из Строка

&Желудь
&Характер("Компанейский")
Процедура ПриСозданииОбъекта()

	ПриУспехе();

	ВремяХранения = "";
	Пути = Новый Массив();
	ОтчетыJUnit = Новый Массив();
КонецПроцедуры

Процедура Всегда() Экспорт

	Когда = СобытияПайплайна.Всегда();
	
КонецПроцедуры

Процедура ПриУспехе() Экспорт

	Когда = СобытияПайплайна.ПриУспехе();
	
КонецПроцедуры

Процедура ПриНеудаче() Экспорт

	Когда = СобытияПайплайна.ПриНеудаче();
	
КонецПроцедуры