// BSLLS:ExportVariables-off

Перем Наименование Экспорт; // Строка
Перем Стадия Экспорт; // Строка
Перем ТегиРаннера Экспорт; // Массив из Строка
Перем Когда Экспорт; // Строка
Перем Переменные Экспорт; // Соответствие
Перем Правила Экспорт; // Массив из см. НовыйПравило()
Перем Нуждается Экспорт; // Массив из Строка
Перем Зависимости Экспорт; // Массив из Строка

&Пластилин("ОписаниеОбраза")
Перем Образ Экспорт; // ОписаниеОбраза

&Пластилин("ОписаниеАртефактов")
Перем Артефакты Экспорт; // ОписаниеАртефактов

&Пластилин("ОписаниеКэша")
Перем Кэш Экспорт; // ОписаниеКэша

&Табакерка
&Пластилин("ОписаниеСервиса")
Перем ОписаниеСервиса; // Табакерка фабрики ОписаниеСервиса

Перем Сервисы Экспорт; // Массив из ОписаниеСервиса

&Пластилин("ОписаниеПовтора")
Перем Повтор Экспорт; // ОписаниеПовтора

&Пластилин("ОписаниеПараллельности")
Перем Параллельность Экспорт; // ОписаниеПараллельности

Перем Скрипты Экспорт; // Массив из Строка
Перем ПередСкрипты Экспорт; // Массив из Строка
Перем ПослеСкрипты Экспорт; // Массив из Строка
Перем РазрешитьПадение Экспорт; // Булево
Перем СтартоватьСразу Экспорт; // Булево
Перем Таймаут Экспорт; // Строка
Перем Прерываемый Экспорт; // Булево

&Желудь
&Характер("Компанейский")
Процедура ПриСозданииОбъекта()

	Правила = Новый Массив(); // Массив из см. НовыйПравило()

	ПриУспехе();

	Наименование = "";
	Стадия = "";
	ТегиРаннера = Новый Массив;
	Переменные = Новый Соответствие();

	Нуждается = Новый Массив;
	Зависимости = Новый Массив;

	Скрипты = Новый Массив();
	ПередСкрипты = Новый Массив();
	ПослеСкрипты = Новый Массив();
	РазрешитьПадение = Ложь;
	СтартоватьСразу = Ложь;
	Таймаут = "";
	Прерываемый = Ложь;
	Сервисы = Новый Массив();
КонецПроцедуры

// Добавляет правло (условие работы джобы)
//
// Параметры:
//   Условие - Строка - Например $CI_PIPELINE_SOURCE == "merge_request_event"
//   Когда - Строка - см. СобытияПайплайна
//   Изменения - Массив из Строка, Неопределено -
//
Процедура ДобавитьПравило(Условие = "", Когда = "", Изменения = Неопределено) Экспорт

	ОписаниеПравила = НовыйПравило();
	ОписаниеПравила.Условие = Условие;
	ОписаниеПравила.Когда = Когда;
	Если НЕ Изменения = Неопределено Тогда
		ОписаниеПравила.Изменения = Изменения;
	КонецЕсли;

	Правила.Добавить(ОписаниеПравила);

КонецПроцедуры

Процедура ДобавитьПередСкрипт(Команда) Экспорт

	ПередСкрипты.Добавить(Команда);

КонецПроцедуры

Процедура ДобавитьПослеСкрипт(Команда) Экспорт

	ПослеСкрипты.Добавить(Команда);

КонецПроцедуры

// Добавляет переменную окружения джобы
//
// Параметры:
//   Имя - Строка - имя переменной
//   Значение - Строка - значение
//
Процедура ДобавитьПеременную(Имя, Значение) Экспорт
	Переменные.Вставить(Имя, Значение);
КонецПроцедуры

// Создает описание сервиса (контейнер-помощник джобы)
//
//  Возвращаемое значение:
//   ОписаниеСервиса - новое описание сервиса
//
Функция НовыйСервис() Экспорт

	Сервис = ОписаниеСервиса.Достать();
	Сервисы.Добавить(Сервис);

	Возврат Сервис;

КонецФункции

Процедура РучнойЗапуск() Экспорт

	Когда = СобытияПайплайна.РучнойЗапуск();
	
КонецПроцедуры

Процедура Всегда() Экспорт

	Когда = СобытияПайплайна.Всегда();
	
КонецПроцедуры

Процедура ПриУспехе() Экспорт

	Когда = СобытияПайплайна.ПриУспехе();
	
КонецПроцедуры

Процедура ПриНеудаче() Экспорт

	Когда = СобытияПайплайна.ПриНеудаче();
	
КонецПроцедуры

Процедура Никогда() Экспорт

	Когда = СобытияПайплайна.Никогда();
	
КонецПроцедуры

// Описание нового правила
//
//  Возвращаемое значение:
//  Структура:
//  * Условие - Строка -
//  * Когда - Строка -
//  * Изменения - Массив из Строка -
//
Функция НовыйПравило() Экспорт
	Возврат Новый Структура("Условие, Когда, Изменения", "", "", Новый Массив());
КонецФункции