// BSLLS:ExportVariables-off

Перем Пути Экспорт; // Массив из Строка
Перем Ключ Экспорт; // Строка
Перем КлючПоФайлам Экспорт; // Массив из Строка
Перем КлючПоКоммитам Экспорт; // Массив из Строка
Перем ПрефиксКлюча Экспорт; // Строка
Перем Когда Экспорт; // Строка
Перем Политика Экспорт; // Строка
Перем Неотслеживаемые Экспорт; // Булево
Перем БезЗащиты Экспорт; // Булево
Перем РезервныеКлючи Экспорт; // Массив из Строка

&Желудь
&Характер("Компанейский")
Процедура ПриСозданииОбъекта()

	ПриУспехе();
	ЧтениеИЗапись();

	Пути = Новый Массив();
	Ключ = "";
	КлючПоФайлам = Новый Массив();
	КлючПоКоммитам = Новый Массив();
	ПрефиксКлюча = "";
	Неотслеживаемые = Ложь;
	БезЗащиты = Ложь;
	РезервныеКлючи = Новый Массив();
КонецПроцедуры

Процедура ДобавитьПуть(Путь) Экспорт

	Пути.Добавить(Путь);

КонецПроцедуры

Процедура Всегда() Экспорт

	Когда = СобытияПайплайна.Всегда();
	
КонецПроцедуры

Процедура ПриУспехе() Экспорт

	Когда = СобытияПайплайна.ПриУспехе();
	
КонецПроцедуры

Процедура ПриНеудаче() Экспорт

	Когда = СобытияПайплайна.ПриНеудаче();
	
КонецПроцедуры

Процедура ТолькоЧтение() Экспорт

	Политика = КэшПайплайна.ТолькоЧтение();
	
КонецПроцедуры

Процедура ТолькоЗапись() Экспорт

	Политика = КэшПайплайна.ТолькоЗапись();
	
КонецПроцедуры

Процедура ЧтениеИЗапись() Экспорт

	Политика = КэшПайплайна.ЧтениеИЗапись();
	
КонецПроцедуры
