// BSLLS:ExportVariables-off

Перем Имя Экспорт; // Строка
Перем УРЛ Экспорт; // Строка
Перем ПриОстановке Экспорт; // Строка - имя джобы, останавливающей окружение (on_stop)
Перем Действие Экспорт; // Строка - взаимодействие с окружением (см. ДействияОкружения)
Перем АвтоОстановка Экспорт; // Строка - время жизни окружения (auto_stop_in), например "1 week"

&Желудь
&Характер("Компанейский")
Процедура ПриСозданииОбъекта()

	Имя = "";
	УРЛ = "";
	ПриОстановке = "";
	Действие = "";
	АвтоОстановка = "";

КонецПроцедуры
