// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

&Табакерка
&Пластилин
Перем ОписаниеЗадачи;

Перем Задачи;

&Желудь
Процедура ПриСозданииОбъекта()
	Задачи = Новый Массив();
КонецПроцедуры

// Возвращает массив накопленных задач
//
//  Возвращаемое значение:
//   Массив из ОписаниеЗадачи - 
//
Функция Задачи() Экспорт
	Возврат Задачи;
КонецФункции

// Создание нового "ОписаниеЗадачи"
//
//  Возвращаемое значение:
//   ОписаниеЗадачи - новое описание задачи
//
Функция Новая() Экспорт

	Задача = ОписаниеЗадачи.Достать();

	Задачи.Добавить(Задача);

	Возврат Задача;
	
КонецФункции


